app/views/events/index.html.erb

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
        <td><%= event.time ? event.time.strftime("%H:%M:%S") : "-" %></td>
        <td><%= event.group.name %></td>