app/views/events/show.html.erb

  <strong>Actor:</strong>
  <%= @event.group.name %>
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1