app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT `events`.* FROM `events`

  def new
    @event = Event.new
    @groups = Group.all.order(:name)
    @options = Option.all
    @targets = Target.all.order(:name)
---
SELECT `groups`.* FROM `groups` ORDER BY `groups`.`name` ASC
SELECT `options`.* FROM `options`
SELECT `targets`.* FROM `targets` ORDER BY `targets`.`name` ASC

  def edit
    @groups = Group.all.order(:name)
    @options = Option.all
    @targets = Target.all.order(:name)
---
SELECT `groups`.* FROM `groups` ORDER BY `groups`.`name` ASC
SELECT `options`.* FROM `options`
SELECT `targets`.* FROM `targets` ORDER BY `targets`.`name` ASC

  def create
    @event = Event.new(event_params)
    @event.time = Time.now
    @event.group_points = 0
    @group =  Group.find(event_params[:group_id])
    @target = Target.find(event_params[:target_id]) if event_params[:target_id]
    @target_group = Group.find(event_params[:target_group_id]) if event_params[:target_group_id]

    if  @event.option.name == "hat Posten geholt"
            @last_time = Event.where(option: @event.option, group: @group, target: @target).last
         if @last_time
             @event.group_points = 0
             @event.description = "schon geholt"
             puts "="
             puts @last_time
         else
            @event.group_points =   @target.points + @target.mines
            @event.group_points += 100 if @target.count ==  0
            @event.description = "Boom! #{@target.mines}" if @target.mines != 0
            @target.mines = 0
            @target.count += 1
         end

    elsif @event.option.name == "hat Mine gesetzt"
        if @event.group.points < @event.points_set
---
SELECT `groups`.* FROM `groups`
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
SELECT  `targets`.* FROM `targets` WHERE `targets`.`id` = 1 LIMIT 1
SELECT  `events`.* FROM `events` WHERE `events`.`option_id` = 1 AND `events`.`group_id` = 3 AND `events`.`target_id` = 1 ORDER BY `events`.`id` DESC LIMIT 1
SELECT  `options`.* FROM `options` WHERE `options`.`id` = 2 LIMIT 1
SELECT `options`.* FROM `options`
SELECT  `events`.* FROM `events` WHERE `events`.`id` = NULL LIMIT 1
SELECT `targets`.* FROM `targets`
SELECT  `events`.* FROM `events` WHERE `events`.`option_id` = 7 AND `events`.`target_group_id` = 2 AND `events`.`group_id` = 1 ORDER BY `events`.`time` DESC LIMIT 1



    respond_to do |format|
      if @event.save
        @group.save if @group.name != 0
        @target_group.save
---
INSERT INTO `events` (`time`, `group_id`, `points_set`, `target_id`, `description`, `created_at`, `updated_at`, `target_group_id`, `group_points`, `target_points`, `option_id`) VALUES ('2016-09-07 16:15:32', 3, 0, 4, 'zu spät', '2016-09-07 16:15:32', '2016-09-07 16:15:32', 1, 0, 0, 7)
UPDATE `groups` SET `points` = -400, `updated_at` = '2016-09-04 20:05:47' WHERE `groups`.`id` = 2
UPDATE `targets` SET `mines` = 0, `count` = 5, `last_action` = '2016-09-04 21:19:19', `updated_at` = '2016-09-04 21:19:19' WHERE `targets`.`id` = 1

  def update
    @groups = Group.all.order(:name)
    @options = Option.all
    @targets = Target.all.order(:name)
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE `events` SET `target_id` = 2, `updated_at` = '2016-09-04 21:23:19' WHERE `events`.`id` = 67

  def destroy
    @event.destroy
---
DELETE FROM `events` WHERE `events`.`id` = 5

    def set_event
      @event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 8 LIMIT 1