app/controllers/groups_controller.rb

  def index
    @groups = Group.all.order(:name)
---
SELECT `groups`.* FROM `groups` ORDER BY `groups`.`name` ASC

  def create
    @group = Group.new(group_params)
    @group.points = 0

    respond_to do |format|
      if @group.save
---
INSERT INTO `groups` (`name`, `points`, `member1`, `member2`, `member3`, `member4`, `false_information`, `created_at`, `updated_at`) VALUES ('Gruppe 4', 0, '', '', '', '', 0, '2016-09-04 20:13:36', '2016-09-04 20:13:36')

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE `groups` SET `points` = 0, `updated_at` = '2016-09-04 20:06:49' WHERE `groups`.`id` = 3

  def destroy
    @group.destroy
---
DELETE FROM `groups` WHERE `groups`.`id` = 4

    def set_group
      @group = Group.find(params[:id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 4 LIMIT 1