app/controllers/options_controller.rb

SELECT `options`.* FROM `options`
---
  def index
    @options = Option.all

INSERT INTO `options` (`name`, `created_at`, `updated_at`) VALUES ('hat posten geholt', '2016-09-03 11:01:21', '2016-09-03 11:01:21')
---
  def create
    @option = Option.new(option_params)

    respond_to do |format|
      if @option.save

UPDATE `options` SET `name` = 'hat Gruppe fotografiert', `updated_at` = '2016-09-03 16:16:42' WHERE `options`.`id` = 2
---
  def update
    respond_to do |format|
      if @option.update(option_params)

DELETE FROM `options` WHERE `options`.`id` = 4
---
  def destroy
    @option.destroy

SELECT  `options`.* FROM `options` WHERE `options`.`id` = 4 LIMIT 1
---
    def set_option
      @option = Option.find(params[:id])