app/controllers/targets_controller.rb

  def index
    @targets = Target.all.order(:name).to_ary.sort_by {|t| ary = t.name.split(" ").map(&:to_i).inject(&:+)}
---
SELECT `targets`.* FROM `targets` ORDER BY `targets`.`name` ASC

  def create
    @target = Target.new(target_params)

    respond_to do |format|
      if @target.save
---
INSERT INTO `targets` (`name`, `description`, `points`, `last_action`, `created_at`, `updated_at`) VALUES ('Posten 1', '', 100, '2016-09-03 10:56:00', '2016-09-03 10:56:22', '2016-09-03 10:56:22')

  def update
    respond_to do |format|
      if @target.update(target_params)
---
UPDATE `targets` SET `count` = 0, `last_action` = '2016-09-05 20:12:00', `updated_at` = '2016-09-08 13:22:42' WHERE `targets`.`id` = 1

    def set_target
      @target = Target.find(params[:id])
---
SELECT  `targets`.* FROM `targets` WHERE `targets`.`id` = 1 LIMIT 1